In [1]:
import pandas as pd
from category_encoders import BinaryEncoder

In [5]:
data=pd.read_csv('demo.csv')
data

    name  age         city country  salary
0    sam    21         tkm   india   40000
1   ishu    21       neela   india   50000
2   bala    20       neela   india   50000
3    vel    21     kannagi   india  200000
4  latha    20  thiruporur   india   30000
5  leela    20  thiruporur   india  100000

In [9]:
encoder= BinaryEncoder(cols=['age '])

In [8]:
print(data.columns)

Index(['name', 'age ', 'city', 'country', 'salary'], dtype='object')

In [10]:
df_encoder = encoder.fit_transform(data)

c:\Users\sam\AppData\Local\Programs\Python\Python311\Lib\site-packages\category_encoders\ordinal.py:198: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  X[column] = X[column].astype("object").fillna(np.nan).map(col_mapping)
c:\Users\sam\AppData\Local\Programs\Python\Python311\Lib\site-packages\category_encoders\ordinal.py:198: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  X[column] = X[column].astype("object").fillna(np.nan).map(col_mapping)
c:\Users\sam\AppData\Local\Programs\Python\Python311\Lib\site-packages\category_encoders\ordinal.py:198: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  X[column] = X[column].astype("object").fillna(np.nan).map(col_mapping)

In [11]:
df_encoder

    name  age _0  age _1        city country  salary
0    sam       0       1         tkm   india   40000
1   ishu       0       1       neela   india   50000
2   bala       1       0       neela   india   50000
3    vel       0       1     kannagi   india  200000
4  latha       1       0  thiruporur   india   30000
5  leela       1       0  thiruporur   india  100000